package com.nokia.example.Redis;

/**
 * Created by YLongYao on 2016/12/12.
 */
public class BaseInfo {
    /**
     * redis是一个开源的、高新能的key-value数据库，内存存储的数据结构的服务器，可用作数据库、高速缓存、消息对列
     * 支持：字符串、哈希表、列表、集合、有序集合、位图等
     * 特点：
     *      支持数据持久化，可将内存中的数据保持在磁盘中，重启的时候可以再次加载使用
     *      支持数据备份
     *      不仅仅支持key-value类型的数据，还支持list、set、zset、hash等数据结构
     * 优势：
     *      性能极高，能读的速度是110000次/秒，写的速度是81000次/秒
     *      丰富的数据类型支持
     *      所有的操作都是原子性的，同时支持对几个操作合并后的原子执行
     *
     * 数据类型：
     *      String：一个key对应一个value，可包含任何数据，如：图片或序列化的对象，一个键最大存储为512M
     */
}
